Merge pull request #1 from Nuru-AI/frontend-api-fixes
Frontend api fixes
